uhnp/src/AccumulationRegisters/ОперацииБюджетов/ОперацииБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОперацииБюджетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лимит</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаИсполнено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоИсполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитИсполнено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВерсии</name>
    <type>
      <types>DefinedType.ИсточникВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаданВОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсПланирования</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЛимитирования</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаДокумента</name>
    <type>
      <types>DefinedType.КорректировкаДокумента</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ОбъектыПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПоставки</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПартнеров</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияРасчетовСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ГрафикиДоговора/ГрафикиДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГрафикиДоговора</name>
  <enumValues>
    <name>ГрафикПоставок</name>
  </enumValues>
  <enumValues>
    <name>ГрафикРасчетов</name>
  </enumValues>
  <enumValues>
    <name>Резервирование</name>
  </enumValues>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ЭлементыСтруктурыЗадолженности/ЭлементыСтруктурыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыСтруктурыЗадолженности</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссии</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКомиссии</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойДолгКонтрагента</name>
    <comment>Основной долг контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКонтрагента</name>
    <comment>Проценты контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>УслугаПоАрендеАванс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/МестаПоставки/МестаПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МестаПоставки</name>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыМестПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКонтактногоЛица</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ОперацииГрафиковДоговоров/ОперацииГрафиковДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОперацииГрафиковДоговоров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АккредитивВыданный</name>
      <description>Аккредитив выданный</description>
    </items>
    <items>
      <name>ЛизингПолученный</name>
      <description>Аренда, лизинг</description>
    </items>
    <items>
      <name>ГарантияВыданная</name>
      <description>Банковская гарантия выданная</description>
    </items>
    <items>
      <name>ВалютноПроцентныйСвоп</name>
      <description>Валютно-процентный своп</description>
    </items>
    <items>
      <name>ВалютныйСвоп</name>
      <description>Валютный своп</description>
    </items>
    <items>
      <name>ВалютныйФорвард</name>
      <description>Валютный форвард</description>
    </items>
    <items>
      <name>ВексельВыданный</name>
      <description>Вексель выданный</description>
    </items>
    <items>
      <name>ВексельПолученный</name>
      <description>Вексель полученный</description>
    </items>
    <items>
      <name>Депозит</name>
      <description>Депозит</description>
    </items>
    <items>
      <name>ДоходныйКоммерческийДоговор</name>
      <description>Доходный коммерческий договор</description>
    </items>
    <items>
      <name>ЗаемВыданный</name>
      <description>Заем выданный</description>
    </items>
    <items>
      <name>ЗаемПолученный</name>
      <description>Заем полученный</description>
    </items>
    <items>
      <name>КредитПолученный</name>
      <description>Кредит полученный</description>
    </items>
    <items>
      <name>МНО</name>
      <description>Минимальный неснижаемый остаток</description>
    </items>
    <items>
      <name>ОблигацияВыпущенная</name>
      <description>Облигация выпущенная</description>
    </items>
    <items>
      <name>ОблигацияКупленная</name>
      <description>Облигация купленная</description>
    </items>
    <items>
      <name>Овердрафт</name>
      <description>Овердрафт</description>
    </items>
    <items>
      <name>РасходныйКоммерческийДоговор</name>
      <description>Расходный коммерческий договор</description>
    </items>
  </predefined>
  <attributes>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолонкаСекции</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДвижения</name>
    <comment>В зависимости от вида бюджета, либо доход/расход, либо поступление/платеж</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВзаиморасчетов</name>
    <comment>Приход - дебиторская задолженность, расход - кредиторская</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВводНачальныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийВводНачальныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ГруппыСтатейБюджета</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролироватьНаправление</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/ЗаказПоставщикуСерверВнедрениеЕХ/Module.bsl
#Область ПрограммныйИнтерфейс
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ФормаДокумента
	
#Область ОбработчикиСобытий

Процедура ФормаДокумента_ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт

	АналитикиПланированияДокументов.ПриЧтенииНаСервере(Форма);  
	
КонецПроцедуры

Процедура ФормаДокумента_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	#Область УХ_УниверсальныеПроцессыСогласование
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(Форма);
	Элементы.Переместить(Элементы.ГруппаСтатусыСогласования, Элементы.ГруппаДанныеДокумента, Элементы.ГруппаСтраницы);
	#КонецОбласти
	
	//АналитикиПланированияДокументов.ПриСозданииНаСервере(Форма, Элементы.Комментарий.Родитель, Элементы.Комментарий);
	КонтрольУХ.ПодготовитьФормуНаСервере(Форма, Элементы.ГруппаСтраницы);
	
	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "БанковскийСчетКонтрагента", ,
		"Объект.БанковскийСчетКонтрагента",, Элементы.ГруппаПараметрыПраво);
	
	ФормаДокумента_ИнициализироватьФормуЦУЗ(Форма);
	АккредитацияПоставщиковУХ.ПриСозданииНаСервереФормыКонтрагентаВнешнегоПоставщика(
	Форма, Отказ, "Список",,, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ФормаДокумента_ЗаполнитьДопРеквизитыЦУЗ(Форма);
	ФормаДокумента_УстановитьДоступныеСкладыНаСервере(Форма);
	ФормаДокумента_УстановитьОформлениеЭлементовЦУЗ(Форма);
	ФормаДокумента_УстановитьУсловноеОформлениеЭлементовЦУЗ(Форма);
	
	ВзаиморасчетыСервер.ОбновитьТекстГиперссылкиЭтапыОплаты(Форма);
	
КонецПроцедуры

// ОбработатьНаСервере - Произвольное значение - вид значения определяется
//		функцией ЗаказПоставщикуКлиентВнедрениеЕХ.ПолеФормыПриИзменении().
//
Процедура ФормаДокумента_ПолеФормыПриИзменении(Форма, Элемент, ОбработатьНаСервере) Экспорт
	Если Элемент.Имя = "МестоПоставки" Тогда
		ФормаДокумента_УстановитьДоступныеСкладыНаСервере(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ФормаДокумента_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ВзаиморасчетыСервер.ОбновитьТекстГиперссылкиЭтапыОплаты(Форма);

	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(Форма);
	
	КонтрольУХ.ИнициализироватьРезультатыКонтроля(Форма); 
	
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеФункции

Процедура ФормаДокумента_УстановитьОформлениеЭлементовЦУЗ(Форма) Экспорт
		Элементы = Форма.Элементы;
		Объект = Форма.Объект;
		Если Форма.Элементы.Найти("Договор") <> Неопределено И ЗначениеЗаполнено(Форма.Договор)
			 Тогда
			 ВерсияСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Договор,"ВерсияСоглашения");
			 ИспользуетсяГрафик = ЗначениеЗаполнено(ВерсияСоглашения) И ВерсияСоглашения.Номенклатура.Количество() > 0;
		Иначе 
			ИспользуетсяГрафик = Истина;
		КонецЕсли;	
		ПараметрыЭлементовТЧ = ПолучитьПараметрыДобавляемыхЭлементовТЧТовары(
				ПолучитьСтандартныеПараметрыПоляВвода());
		Для Каждого ПараметрыЭлемента Из ПараметрыЭлементовТЧ Цикл      
			Если ПараметрыЭлемента.Имя = "ТоварыОрганизацияПолучатель" ИЛИ
				ПараметрыЭлемента.Имя = "ТоварыНоменклатураМестоПоставки" Тогда
				Продолжить;
			КонецЕсли;	
			Элементы[ПараметрыЭлемента.Имя].Видимость = ИспользуетсяГрафик;
		КонецЦикла;
КонецПроцедуры

Процедура ФормаДокумента_УстановитьДоступныеСкладыНаСервере(Форма) Экспорт
	Перем СтарыйСклад;
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Если Форма.ИспользуетсяУправлениеЗакупками
			И ЗначениеЗаполнено(Объект.МестоПоставки) Тогда
		СтарыйСклад = Объект.Склад;
		мСклады = Справочники.МестаПоставки.СкладыМестаПоставки(Объект.МестоПоставки);
		Элементы.Склад.РежимВыбораИзСписка = Истина;
		Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(мСклады);
		Если мСклады.Количество() = 1 Тогда
			Объект.Склад = мСклады[0];
		КонецЕсли;
		Если СтарыйСклад <> Объект.Склад Тогда
			ЗаказПоставщикуКлиентСерверВнедрениеЕХ.ФормаДокумента_СкладПриИзмененииКлиентСервер(
				Объект);
		КонецЕсли;
	Иначе
		Элементы.Склад.РежимВыбораИзСписка = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ФормаДокумента_ЗаполнитьДопРеквизитыЦУЗ(Форма) Экспорт
	ФормаДокумента_ИнициализироватьФлагИспользованияЦУЗ(Форма);
	ФормаДокумента_ЗаполнитьДопРеквизитыЦУЗТЧТовары(Форма);
КонецПроцедуры

Процедура ФормаДокумента_ЗаполнитьДопРеквизитыЦУЗТЧТовары(Форма) Экспорт
	Объект = Форма.Объект;
	Товары = Объект.Товары;
	Для Каждого СтрокаТовара Из Товары Цикл
		ФормаДокумента_ЗаполнитьДопРеквизитыЦУЗСтрокиТовары(
			Форма, СтрокаТовара);
	КонецЦикла;
КонецПроцедуры

Процедура ФормаДокумента_ИнициализироватьФлагИспользованияЦУЗ(Форма) Экспорт
	Объект = Форма.Объект;
	Форма.ИспользуетсяУправлениеЗакупками =
		ЗначениеЗаполнено(Объект.Договор)
		И ЦентрализованныеЗакупкиКлиентСерверУХ.ЭтоДопустимыйВидДоговораУХ(
			Объект.Договор.ВидДоговораУХ);
КонецПроцедуры

Процедура ФормаДокумента_ЗаполнитьДопРеквизитыЦУЗСтрокиТовары(Форма,
															СтрокаТовара) Экспорт
	СтрокаТовара.ХарактеристикиИсходныеИспользуются =
		УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ХарактеристикиИспользуются(
			СтрокаТовара.НоменклатураИсходная);
КонецПроцедуры
		
#КонецОбласти

#КонецОбласти 

#Область ФормаСписка

Процедура ФормаСписка_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		АккредитацияПоставщиковУХ.ПриСозданииНаСервереФормыКонтрагентаВнешнегоПоставщика(
			Форма, Отказ, "Список",,, Истина);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		СоздатьЭлементыФормыСписка(Форма);
КонецПроцедуры

#КонецОбласти 

#Область МенеджерДокумента
	
#Область ИсточникиДляКонтроляДокумента
	
Функция ИсточникиДокумента(Объект, ДопПараметры = Неопределено) Экспорт
	
	Источники = Новый Соответствие;
	
	// 1. Источник для контроля бюджетных лимитов и резервов
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХБюджетныеЛимиты, 
		Источник_БюджетныеЛимитыРезервы(Объект));
	
	// 2. Контроль суммы по договору
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХРасходыПоДоговору,
		Источник_РасходыПоДоговору(Объект));
		
	// 3. Источник для контроля объема закупок
	КонтрольУХ.ДобавитьИсточник(
		Источники, 
		КонтрольУХОбъемыЗакупок, 
		Источник_ОбъемыЗакупок(Объект, ДопПараметры));

	Возврат Источники;
	
КонецФункции
	
Функция Источник_БюджетныеЛимитыРезервы(Объект)

	// Доп.параметры
	ДопПараметрыИсточника = Новый Структура;
	ДопПараметрыИсточника.Вставить("Дата", Объект.Дата);
	ДопПараметрыИсточника.Вставить("Ссылка", Объект.Ссылка);
	ДопПараметрыИсточника.Вставить("ЭтоНовый", Не ЗначениеЗаполнено(Объект.Ссылка));
	ДопПараметрыИсточника.Вставить("ДатаКонтроляЛимита", Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПланыДокумента(Объект);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ПланыДокумента.ВидБюджета КАК ВидБюджета,
	|	ВТ_ПланыДокумента.Организация КАК Организация,
	|	ВТ_ПланыДокумента.Контрагент КАК Контрагент,
	|	ВТ_ПланыДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ПланыДокумента.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВТ_ПланыДокумента.Валюта КАК Валюта,
	|	ВТ_ПланыДокумента.ДокументПланирования КАК ДокументПланирования,
	|	ВТ_ПланыДокумента.ДокументРезервирования КАК ДокументРезервирования,
	|	ВТ_ПланыДокумента.Период КАК ДатаОперации,
	|	ВТ_ПланыДокумента.ЦФО КАК ЦФО,
	|	ВТ_ПланыДокумента.Проект КАК Проект,
	|	ВТ_ПланыДокумента.ПриходРасход КАК ПриходРасход,
	|	ВТ_ПланыДокумента.СтатьяБюджета КАК СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика1 КАК Аналитика1,
	|	ВТ_ПланыДокумента.Аналитика2 КАК Аналитика2,
	|	ВТ_ПланыДокумента.Аналитика3 КАК Аналитика3,
	|	ВТ_ПланыДокумента.Аналитика4 КАК Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика5 КАК Аналитика5,
	|	ВТ_ПланыДокумента.Аналитика6 КАК Аналитика6,
	|	0 КАК Лимит,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ПланыДокумента.ДокументРезервирования = НЕОПРЕДЕЛЕНО
	|			ТОГДА -СУММА(ВТ_ПланыДокумента.Сумма)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Зарезервировано,
	|	СУММА(ВТ_ПланыДокумента.Сумма) КАК Заявлено,
	|	0 КАК Исполнено
	|ПОМЕСТИТЬ ВТ_ТаблицаПлановССуммамиЛимитирования
	|ИЗ
	|	ВТ_ПланыДокумента КАК ВТ_ПланыДокумента
	|ГДЕ
	|	ВТ_ПланыДокумента.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПланыДокумента.Аналитика6,
	|	ВТ_ПланыДокумента.ДокументПланирования,
	|	ВТ_ПланыДокумента.ДокументРезервирования,
	|	ВТ_ПланыДокумента.Аналитика1,
	|	ВТ_ПланыДокумента.ВидБюджета,
	|	ВТ_ПланыДокумента.ЦФО,
	|	ВТ_ПланыДокумента.СтатьяБюджета,
	|	ВТ_ПланыДокумента.Аналитика4,
	|	ВТ_ПланыДокумента.Аналитика3,
	|	ВТ_ПланыДокумента.Проект,
	|	ВТ_ПланыДокумента.Аналитика5,
	|	ВТ_ПланыДокумента.Организация,
	|	ВТ_ПланыДокумента.Контрагент,
	|	ВТ_ПланыДокумента.ДоговорКонтрагента,
	|	ВТ_ПланыДокумента.ОбъектРасчетов,
	|	ВТ_ПланыДокумента.Период,
	|	ВТ_ПланыДокумента.Валюта,
	|	ВТ_ПланыДокумента.ПриходРасход,
	|	ВТ_ПланыДокумента.Аналитика2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПланыДокумента";
	
	Запрос.Выполнить();
	
	Источник = Новый Структура;
	Источник.Вставить("Параметры", ДопПараметрыИсточника);
	Источник.Вставить("ПланыДокумента", Запрос.МенеджерВременныхТаблиц);
	
	Возврат Источник;

КонецФункции

Функция Источник_РасходыПоДоговору(Объект)
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат неопределено; // Контроль не выполняется
	КонецЕсли;
	
	КонтрольОплаты = Истина;
	Результат = КонтрольУХРасходыПоДоговору.СтруктураИсточник(Объект.Ссылка, Объект.Организация, КонтрольОплаты);
	Результат.Контрагент = Объект.Контрагент;
	Результат.Договор = Объект.Договор;
	
	// Оплата
	Для Каждого Этап Из Объект.ЭтапыГрафикаОплаты Цикл
		Строка = Результат.ДанныеДляПроверки.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Объект, "Организация, Контрагент, Договор, ОбъектРасчетов, Валюта");
		Строка.ЭтоОплата = КонтрольОплаты;
		Строка.Сумма = Этап.СуммаПлатежа;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Источник_ОбъемыЗакупок(Объект, ДопПараметры) Экспорт
	
	// Доп.параметры
	ДопПараметрыИсточника = Новый Структура;
	ДопПараметрыИсточника.Вставить("Дата", 				Объект.Дата);
	ДопПараметрыИсточника.Вставить("Ссылка", 			Объект.Ссылка);
	ДопПараметрыИсточника.Вставить("ЭтоНовый", 			Не ЗначениеЗаполнено(Объект.Ссылка));
	ДопПараметрыИсточника.Вставить("ДатаКонтроляЛимита", Объект.Дата);
		
	ДанныеНоменклатура = ПодтверждениеЗакупокУХ.НоменклатураПотвержденияОбъемаЗакупок(Объект);
	
	Источник = Новый Структура;
	Источник.Вставить("Параметры",			ДопПараметрыИсточника);
	Источник.Вставить("ДанныеНоменклатура", ДанныеНоменклатура);
	Источник.Вставить("НачалоПериода",		НачалоГода(Объект.Дата));
	Источник.Вставить("КонецПериода",		КонецГода(Объект.Дата)); 
	Источник.Вставить("ДокументРегистратор",Объект.Ссылка);    
	
	Возврат Источник;
	
КонецФункции

#КонецОбласти 

#Область ПланыДокумента

// Процедура возвращает таблицу планов документа
//
// Параметры:
//  Источник  - ДокументСсылка, ДокументОбъект, Форма.Объект - Документ планирования
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица планов документа
//
Функция ПланыДокумента(Источник, МенеджерВременныхТаблиц = Неопределено, ИмяВременнойТаблицы = "") Экспорт

	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1 КАК НомерЗапроса,
	|	&Дата КАК ДатаРегистрации,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК ОбъектРасчетов,
	|	&Валюта КАК Валюта,
	|	&Ссылка КАК ДокументПланирования,
	|	ВЫБОР
	|		КОГДА &НеИспользоватьГрафикДоговора
	|			ТОГДА &ДокументРезервированияБДР
	|		ИНАЧЕ &Договор
	|	КОНЕЦ КАК ДокументРезервирования,
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ КАК ДатаОперации,
	|	График.ЦФО КАК ЦФО,
	|	График.Проект КАК Проект,
	|	График.СтатьяБюджетаБДР КАК СтатьяБюджета,
	|	График.АналитикаБДР1 КАК Аналитика1,
	|	График.АналитикаБДР2 КАК Аналитика2,
	|	График.АналитикаБДР3 КАК Аналитика3,
	|	График.АналитикаБДР4 КАК Аналитика4,
	|	График.АналитикаБДР5 КАК Аналитика5,
	|	График.АналитикаБДР6 КАК Аналитика6,
	|	ВЫБОР
	|		КОГДА &ЦенаВключаетНДС
	|			ТОГДА График.Сумма - График.СуммаНДС
	|		ИНАЧЕ График.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход) КАК ПриходРасход,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов) КАК ВидБюджета
	|ПОМЕСТИТЬ ВТ_ПланыДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК График
	|ГДЕ
	|	График.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	&Дата,
	|	&Организация,
	|	&Контрагент,
	|	&Договор,
	|	&Ссылка,
	|	&Валюта,
	|	&Ссылка,
	|	ВЫБОР
	|		КОГДА &НеИспользоватьГрафикДоговора
	|			ТОГДА &ДокументРезервированияБДДС
	|		ИНАЧЕ &Договор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА График.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаПлатежа
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА График.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаПлатежа
	|	КОНЕЦ,
	|	График.ЦФО,
	|	График.Проект,
	|	График.СтатьяБюджета,
	|	График.Аналитика1,
	|	График.Аналитика2,
	|	График.Аналитика3,
	|	График.Аналитика4,
	|	График.Аналитика5,
	|	График.Аналитика6,
	|	График.СуммаПлатежа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|ИЗ
	|	Документ.ЗаказПоставщику.ГрафикОплатыУХ КАК График
	|ГДЕ
	|	График.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	&Дата,
	|	&Организация,
	|	&Контрагент,
	|	&Договор,
	|	&Ссылка,
	|	&Валюта,
	|	&Договор,
	|	&Договор,
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ,
	|	График.ЦФО,
	|	График.Проект,
	|	График.СтатьяБюджетаБДР,
	|	График.АналитикаБДР1,
	|	График.АналитикаБДР2,
	|	График.АналитикаБДР3,
	|	График.АналитикаБДР4,
	|	График.АналитикаБДР5,
	|	График.АналитикаБДР6,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) <= 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) < ВЫБОР
	|				КОГДА &ЦенаВключаетНДС
	|					ТОГДА График.Сумма - График.СуммаНДС
	|				ИНАЧЕ График.Сумма
	|			КОНЕЦ
	|			ТОГДА -ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЦенаВключаетНДС
	|					ТОГДА -(График.Сумма - График.СуммаНДС)
	|				ИНАЧЕ -График.Сумма
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов)
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК График
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОперацииБюджетов.Обороты(, , Авто, ) КАК ОперацииБюджетовОбороты
	|		ПО График.СтатьяБюджетаБДР = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.СтатьяБюджета
	|			И График.АналитикаБДР1 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика1
	|			И График.АналитикаБДР2 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика2
	|			И График.АналитикаБДР3 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика3
	|			И График.АналитикаБДР4 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика4
	|			И График.АналитикаБДР5 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика5
	|			И График.АналитикаБДР6 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика6
	|			И (&Договор = ОперацииБюджетовОбороты.ОбъектПланирования.Объект)
	|			И ОперацииБюджетовОбороты.ВидБюджета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов)
	|ГДЕ
	|	График.Ссылка = &Ссылка
	|	И НЕ &НеИспользоватьГрафикДоговора
	|	И ОперацииБюджетовОбороты.Регистратор <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	&Дата,
	|	&Организация,
	|	&Контрагент,
	|	&Договор,
	|	&Ссылка,
	|	&Валюта,
	|	&ДокументРезервированияБДР,
	|	&Договор,
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ,
	|	График.ЦФО,
	|	График.Проект,
	|	График.СтатьяБюджетаБДР,
	|	График.АналитикаБДР1,
	|	График.АналитикаБДР2,
	|	График.АналитикаБДР3,
	|	График.АналитикаБДР4,
	|	График.АналитикаБДР5,
	|	График.АналитикаБДР6,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) <= 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) < ВЫБОР
	|				КОГДА &ЦенаВключаетНДС
	|					ТОГДА График.Сумма - График.СуммаНДС
	|				ИНАЧЕ График.Сумма
	|			КОНЕЦ
	|			ТОГДА -ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЦенаВключаетНДС
	|					ТОГДА -(График.Сумма - График.СуммаНДС)
	|				ИНАЧЕ -График.Сумма
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов)
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК График
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОперацииБюджетов.Обороты(, , Авто, ) КАК ОперацииБюджетовОбороты
	|		ПО График.СтатьяБюджетаБДР = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.СтатьяБюджета
	|			И График.АналитикаБДР1 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика1
	|			И График.АналитикаБДР2 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика2
	|			И График.АналитикаБДР3 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика3
	|			И График.АналитикаБДР4 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика4
	|			И График.АналитикаБДР5 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика5
	|			И График.АналитикаБДР6 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика6
	|			И (&ДокументРезервированияБДР = ОперацииБюджетовОбороты.ОбъектПланирования.Объект)
	|			И ОперацииБюджетовОбороты.ВидБюджета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов)
	|ГДЕ
	|	График.Ссылка = &Ссылка
	|	И &НеИспользоватьГрафикДоговора
	|	И ОперацииБюджетовОбороты.Регистратор <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	&Дата,
	|	&Организация,
	|	&Контрагент,
	|	&Договор,
	|	&Ссылка,
	|	&Валюта,
	|	&Договор,
	|	&Договор,
	|	ВЫБОР
	|		КОГДА График.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаПлатежа
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА График.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Дата
	|		ИНАЧЕ График.ДатаПлатежа
	|	КОНЕЦ,
	|	График.ЦФО,
	|	График.Проект,
	|	График.СтатьяБюджета,
	|	График.Аналитика1,
	|	График.Аналитика2,
	|	График.Аналитика3,
	|	График.Аналитика4,
	|	График.Аналитика5,
	|	График.Аналитика6,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) <= 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0) < График.СуммаПлатежа
	|			ТОГДА -ЕСТЬNULL(ОперацииБюджетовОбороты.ЛимитОборот, 0)
	|		ИНАЧЕ -График.СуммаПлатежа
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|ИЗ
	|	Документ.ЗаказПоставщику.ГрафикОплатыУХ КАК График
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОперацииБюджетов.Обороты(, , Авто, ) КАК ОперацииБюджетовОбороты
	|		ПО График.СтатьяБюджета = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.СтатьяБюджета
	|			И График.Аналитика1 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика1
	|			И График.Аналитика2 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика2
	|			И График.Аналитика3 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика3
	|			И График.Аналитика4 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика4
	|			И График.Аналитика5 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика5
	|			И График.Аналитика6 = ОперацииБюджетовОбороты.АналитикаСтатейБюджетов.Аналитика6
	|			И (&Договор = ОперацииБюджетовОбороты.ОбъектПланирования.Объект)
	|			И ОперацииБюджетовОбороты.ВидБюджета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|ГДЕ
	|	График.Ссылка = &Ссылка
	|	И НЕ &НеИспользоватьГрафикДоговора
	|	И ОперацииБюджетовОбороты.Регистратор <> &Ссылка";
		
	ИменаРеквизитов = "Дата, Валюта, Организация, Контрагент, Договор, ЦенаВключаетНДС";
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументРезервированияБДР", "График.АналитикаПланирования.ОбъектПланирования.Объект");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументРезервированияБДДС", "Неопределено");
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ИменаРеквизитов);
		
		ВерсияСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.Договор, "ВерсияСоглашения");
		НеИспользоватьГрафикДоговора = НЕ ЗначениеЗаполнено(ВерсияСоглашения) 
						ИЛИ ВерсияСоглашения.ГрафикДоговора = Перечисления.ГрафикиДоговора.НеИспользовать;

		Запрос.УстановитьПараметр("НеИспользоватьГрафикДоговора", НеИспользоватьГрафикДоговора);
		
	Иначе
		РеквизитыДокумента = Источник; 
		
		ВерсияСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.Договор, "ВерсияСоглашения");
		НеИспользоватьГрафикДоговора = НЕ ЗначениеЗаполнено(ВерсияСоглашения) 
						ИЛИ ВерсияСоглашения.ГрафикДоговора = Перечисления.ГрафикиДоговора.НеИспользовать;

		Запрос.УстановитьПараметр("НеИспользоватьГрафикДоговора", НеИспользоватьГрафикДоговора);
	
		ТаблицаПлановБДР = КонтрольЛимитовУХ.Новый_ТаблицаПланыДокумента();
		
		ТаблицаПлановБДР.Колонки.Добавить("СтатьяБюджетаБДР", Метаданные.ПланыВидовХарактеристик.ВидыБюджетов.Тип);
		ТаблицаПлановБДР.Колонки.Добавить("ДатаОтгрузки", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
		ТаблицаПлановБДР.Колонки.Добавить("СуммаНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		ТаблицаПлановБДР.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
		
		Для Ном = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
			ТаблицаПлановБДР.Колонки.Добавить("АналитикаБДР" + Формат(Ном, "ЧГ="), 
				Новый ОписаниеТипов(Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип));
		КонецЦикла;
		
		БюджетДоходовИРасходов = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов;
		Расход = Перечисления.ВидыДвиженийПриходРасход.Расход;
		
		Для Каждого СтрокаТабличнойЧасти Из Источник.Товары Цикл
			
			ДатаОтгрузки = НачалоДня(?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаОтгрузки),
							СтрокаТабличнойЧасти.ДатаОтгрузки, РеквизитыДокумента.Дата));
			
			НоваяСтрока = ТаблицаПлановБДР.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыДокумента);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			
			НоваяСтрока.ВидБюджета = БюджетДоходовИРасходов;
			НоваяСтрока.ДоговорКонтрагента = РеквизитыДокумента.Договор;
			НоваяСтрока.ПриходРасход = Расход; 
			НоваяСтрока.Период = ДатаОтгрузки;
			НоваяСтрока.ДатаОперации = ДатаОтгрузки;
			НоваяСтрока.ДатаОтгрузки = ДатаОтгрузки;
			НоваяСтрока.ДокументПланирования = РеквизитыДокумента.Ссылка;
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.АналитикаПланирования.ОбъектПланирования) Тогда
				НоваяСтрока.ДокументРезервирования = СтрокаТабличнойЧасти.АналитикаПланирования.ОбъектПланирования.Объект;
			Иначе
				НоваяСтрока.ДокументРезервирования = ?(НеИспользоватьГрафикДоговора, Неопределено, РеквизитыДокумента.Договор);
			КонецЕсли;
			НоваяСтрока.Ссылка = РеквизитыДокумента.Ссылка;
			
		КонецЦикла;
		
		ТаблицаПлановБДДС = КонтрольЛимитовУХ.Новый_ТаблицаПланыДокумента();
		
		ТаблицаПлановБДДС.Колонки.Добавить("СтатьяБюджетаБДДС", Метаданные.ПланыВидовХарактеристик.ВидыБюджетов.Тип);
		ТаблицаПлановБДДС.Колонки.Добавить("ДатаПлатежа", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
		ТаблицаПлановБДДС.Колонки.Добавить("СуммаПлатежа", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		
		Для Ном = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
			ТаблицаПлановБДДС.Колонки.Добавить("АналитикаБДДС" + Формат(Ном, "ЧГ="), 
					Новый ОписаниеТипов(Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип));
		КонецЦикла;

		БюджетДвиженияДенежныхСредств = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
		
		Для Каждого СтрокаТабличнойЧасти Из Источник.ГрафикОплатыУХ Цикл
			
			ДатаПлатежа = НачалоДня(?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаПлатежа), 
							СтрокаТабличнойЧасти.ДатаПлатежа, РеквизитыДокумента.Дата));
	
			НоваяСтрока = ТаблицаПлановБДДС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыДокумента);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			
			НоваяСтрока.ВидБюджета = БюджетДвиженияДенежныхСредств;
			НоваяСтрока.ДоговорКонтрагента = РеквизитыДокумента.Договор;
			НоваяСтрока.ПриходРасход = Расход; 
			НоваяСтрока.Сумма = СтрокаТабличнойЧасти.СуммаПлатежа;
			НоваяСтрока.Период = ДатаПлатежа; 
			НоваяСтрока.ДатаОперации = ДатаПлатежа;
			НоваяСтрока.ДатаПлатежа = ДатаПлатежа;
			НоваяСтрока.ДокументПланирования = РеквизитыДокумента.Ссылка;
			НоваяСтрока.ДокументРезервирования = ?(НеИспользоватьГрафикДоговора, Неопределено, РеквизитыДокумента.Договор);
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ТаблицаПлановБДР", ТаблицаПлановБДР);
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Товары ИЗ &ТаблицаПлановБДР КАК Коллекция ";
		Запрос.Выполнить();
		
		Запрос.УстановитьПараметр("ТаблицаПлановБДДС", ТаблицаПлановБДДС);
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ГрафикОплатыУХ ИЗ &ТаблицаПлановБДДС КАК Коллекция ";
		Запрос.Выполнить();
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаказПоставщику.", "ВТ_");   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "График.Ссылка = &Ссылка", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументРезервированияБДР", "График.ДокументРезервирования");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументРезервированияБДДС", "График.ДокументРезервирования");
		
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Новый Структура(ИменаРеквизитов) Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, РеквизитыДокумента[КлючЗначение.Ключ]);
	КонецЦикла;
	
	Если ИмяВременнойТаблицы <> "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_ПланыДокумента", ИмяВременнойТаблицы);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ОбщегоНазначенияОПК.ОчиститьВременныеТаблицы(Запрос, "ВТ_ПланыДокумента");

	Возврат Запрос.МенеджерВременныхТаблиц; 
	
КонецФункции

Функция ДанныеОбъектаПоСсылке(Источник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.Договор КАК Договор,
	|	Документ.ПоступлениеОднойДатой КАК ПоступлениеОднойДатой,
	|	Документ.ДатаПоступления КАК ДатаПоступления,
	|	Документ.ПорядокРасчетов КАК ПорядокРасчетов,
	|	Документ.РежимИспользованияГрафика КАК РежимИспользованияГрафика,
	|	Документ.ЭтапыГрафикаОплаты.(
	|		ДатаПлатежа КАК ДатаПлатежа,
	|		ВариантОплаты КАК ВариантОплаты,
	|		СуммаПлатежа КАК СуммаПлатежа,
	|		СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
	|		ИдентификаторПозиции КАК ИдентификаторПозиции
	|	) КАК ГрафикРасчетов,
	|	Документ.Товары.(
	|		ДатаПоступления КАК ДатаПоступления,
	|		СуммаСНДС КАК СуммаСНДС
	|	) КАК Товары,
	|	Документ.АналитикиПланирования.(
	|		ВидБюджета КАК ВидБюджета,
	|		ДокументРезервирования КАК ДокументРезервирования,
	|		ЦФО КАК ЦФО,
	|		Проект КАК Проект,
	|		СтатьяБюджета КАК СтатьяБюджета,
	|		Аналитика1 КАК Аналитика1,
	|		Аналитика2 КАК Аналитика2,
	|		Аналитика3 КАК Аналитика3,
	|		Аналитика4 КАК Аналитика4,
	|		Аналитика5 КАК Аналитика5,
	|		Аналитика6 КАК Аналитика6
	|	) КАК АналитикиПланирования
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка,, "ГрафикРасчетов");
		Результат.ГрафикРасчетов = Выборка.ГрафикРасчетов.Выгрузить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАналитикиПланированияБДДС(ДанныеОбъекта)
	
	СтруктураПоиска = Новый Структура("ВидБюджета", ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств);
	Строки = ДанныеОбъекта.АналитикиПланирования.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество() > 0 Тогда
		Возврат Строки[0];
	КонецЕсли;
	
	Возврат неопределено;
	
КонецФункции

Функция ПолучитьАналитикиПланированияПоставки(ДанныеОбъекта)
	
	Для Каждого Строка Из ДанныеОбъекта.АналитикиПланирования Цикл
		
		Если Строка.ВидБюджета <> ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств Тогда
			Возврат Строка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат неопределено;
	
КонецФункции

#КонецОбласти 

#Область КомандыСозданияНаОсновании
	
// Определяет список команд создания на основании документа ЗаказПоставщику.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОснованииЗаказПоставщику(КомандыСозданияНаОсновании, Параметры) Экспорт

	// Претензия
	Данные = Метаданные.Справочники.ПретензииУХ;
	НоваяКоманда = ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Данные);
	Если НоваяКоманда <> Неопределено Тогда
		НоваяКоманда.Обработчик = "УправлениеЗакупкамиВстраиваниеПереопределяемыйКлиентУХ.СоздатьСправочникПретензииНаОснованииЗаказаПоставщику";
		НоваяКоманда.ВидимостьВФормах = "ФормаДокумента, ФормаСпискаДокументов";
		НоваяКоманда.МножественныйВыбор = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Определяет список команд создания на основании документа Возврат товаров поставщику.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОснованииВозвратаТоваровПоставщику(КомандыСозданияНаОсновании, Параметры) Экспорт

	// Претензия
	Данные = Метаданные.Справочники.ПретензииУХ;
	НоваяКоманда = ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Данные);
	Если НоваяКоманда <> Неопределено Тогда
		НоваяКоманда.Обработчик = "УправлениеЗакупкамиВстраиваниеПереопределяемыйКлиентУХ.СоздатьСправочникПретензииНаОснованииВозвратаТоваровПоставщику";
		НоваяКоманда.ВидимостьВФормах = "ФормаДокумента, ФормаСписка";
		НоваяКоманда.МножественныйВыбор = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду создания документа по его метаданным.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//	 МетаданныеДокумента - 
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, МетаданныеДокумента) Экспорт
	
	Если ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = МетаданныеДокумента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(МетаданныеДокумента);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти 

Процедура ДобавитьТекстыЗапросов(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ДобавитьТекстЗапросаРасчетыСКонтрагентамиГрафики(ТекстыЗапроса);   
	ДобавитьТекстЗапросаВерсииРасчетов(ТекстыЗапроса);
КонецПроцедуры	

Процедура ДобавитьТекстЗапросаРасчетыСКонтрагентамиГрафики(ТекстыЗапроса)
	
	ИмяРегистра = "РасчетыСКонтрагентамиГрафики";
	
	//Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
	//	Возврат "";
	//КонецЕсли; 
				 
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА График.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НАЧАЛОПЕРИОДА(График.Ссылка.Дата, ДЕНЬ)
	|		ИНАЧЕ График.ДатаОтгрузки
	|	КОНЕЦ КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Ссылка КАК ВерсияГрафика,
	|	График.Ссылка.ОбъектРасчетов.Объект КАК ПредметГрафика,
	|	График.СтатьяБюджетаБДР КАК СтатьяБюджета,
	|	График.АналитикаБДР1 КАК Аналитика1,
	|	График.АналитикаБДР2 КАК Аналитика2,
	|	График.АналитикаБДР3 КАК Аналитика3,
	|	График.АналитикаБДР4 КАК Аналитика4,
	|	График.АналитикаБДР5 КАК Аналитика5,
	|	График.АналитикаБДР6 КАК Аналитика6,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов) КАК ВидБюджета,
	|	График.Ссылка.Договор.ВидДоговораУХ КАК ВидДоговораУХ,
	|	График.ЦФО КАК ЦФО,
	|	График.Проект КАК Проект,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход) КАК ПриходРасход,
	|	График.Сумма КАК Сумма,
	|	&Валюта КАК Валюта,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг) КАК ЭлементСтруктурыЗадолженности,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.РасходныйКоммерческийДоговор_Начисление) КАК Операция,
	|	График.Ссылка.БанковскийСчет КАК СчетОрганизации,
	|	График.Ссылка.БанковскийСчетКонтрагента КАК СчетКонтрагента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК График
	|ГДЕ
	|	График.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	График.ДатаПлатежа,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Ссылка,
	|	График.Ссылка.ОбъектРасчетов.Объект,
	|	График.СтатьяБюджета,
	|	График.Аналитика1,
	|	График.Аналитика2,
	|	График.Аналитика3,
	|	График.Аналитика4,
	|	График.Аналитика5,
	|	График.Аналитика6,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств),
	|	График.Ссылка.Договор.ВидДоговораУХ,
	|	График.ЦФО,
	|	График.Проект,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|	График.СуммаПлатежа,
	|	&Валюта,
	|	&Организация,
	|	&Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг),
	|	ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.РасходныйКоммерческийДоговор_Оплата),
	|	График.СчетОрганизации,
	|	График.СчетКонтрагента
	|ИЗ
	|	Документ.ЗаказПоставщику.ГрафикОплатыУХ КАК График
	|ГДЕ
	|	График.Ссылка = &Ссылка";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

Процедура ДобавитьТекстЗапросаВерсииРасчетов(ТекстыЗапроса) 
	
	ИмяРегистра = "ВерсииГрафиковРасчетов";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсияФИ.Дата КАК Период,
	|	ВерсияФИ.Ссылка КАК ВерсияГрафика,
	|	ВерсияФИ.Ссылка КАК ПредметГрафика,
	|	ВерсияФИ.Организация КАК Организация,
	|	ЛОЖЬ КАК ОпорныйГрафик
	|ИЗ
	|	Документ.ЗаказПоставщику.ГрафикОплатыУХ КАК ЗаказПоставщикуГрафикОплатыУХ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ВерсияФИ
	|		ПО ЗаказПоставщикуГрафикОплатыУХ.Ссылка = ВерсияФИ.Ссылка
	|ГДЕ
	|	ВерсияФИ.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

 #КонецОбласти 
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ФормаДокумента_УстановитьУсловноеОформлениеЭлементовЦУЗ(Форма)
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		Форма,
		"ТоварыХарактеристикаИсходная",
		"Объект.Товары.ХарактеристикиИсходныеИспользуются");
КонецПроцедуры

Функция ПолучитьПараметрыДобавляемыхЭлементовТЧТовары(ПараметрыПоляВвода)
	ДобавляемыеЭлементы = Новый Массив;
	ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
		"ТоварыХарактеристикаИсходная",
		"Объект.Товары.ХарактеристикаИсходная",
		ПолучитьПараметрыПоляВводаХарактеристикиНоменклатуры(
			ПараметрыПоляВвода),
		"ТоварыНоменклатура",
		,
		,
		СоздатьОписаниеСобытий(
			"ПриИзменении",
			"Подключаемый_УХ_НоменклатураХарактеристикаИсходнаяПриИзменении")));
	ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
		"ТоварыНоменклатураИсходная",
		"Объект.Товары.НоменклатураИсходная",
		ПараметрыПоляВвода,
		"ТоварыХарактеристикаИсходная",
		,
		,
		СоздатьОписаниеСобытий(
			"ПриИзменении",
			"Подключаемый_УХ_ТоварыНоменклатураИсходнаяПриИзменении")));
	ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
		"ТоварыОрганизацияПолучатель",
		"Объект.Товары.ОрганизацияПолучатель",
		ПараметрыПоляВвода,,"Потребитель (ЦФО)"));
	ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
		"ТоварыНоменклатураМестоПоставки",
		"Объект.Товары.МестоПоставки",
		ПараметрыПоляВвода));
	//ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
	//	"ТоварыПериодПотребности",
	//	"Объект.Товары.ПериодПотребности",
	//	ПараметрыПоляВвода));
	//ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
	//	"ТоварыПриоритетЗакупок",
	//	"Объект.Товары.Приоритет",
	//	ПараметрыПоляВвода));
	//ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
	//	"ТоварыМенеджерЗакупок",
	//	"Объект.Товары.Менеджер",
	//	ПараметрыПоляВвода));
	ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
		"ТоварыПроектЗакупок",
		"Объект.Товары.Проект",
		ПараметрыПоляВвода));
	//ДобавляемыеЭлементы.Добавить(ПолучитьПараметрыЭлементаФормы(
	//	"ТоварыДоговорСПокупателем",
	//	"Объект.Товары.ДоговорСПокупателем",
	//	ПараметрыПоляВвода));    
	ДобавляемыеЭлементы.Добавить(ЗаказПоставщикуСерверВнедрениеЕХ.ПолучитьПараметрыЭлементаФормы(
		"ТоварыСтранаПроисхождения",
		"Объект.Товары.СтраныПроисхождения",
		ПараметрыПоляВвода));
	ДобавляемыеЭлементы.Добавить(ЗаказПоставщикуСерверВнедрениеЕХ.ПолучитьПараметрыЭлементаФормы(
		"ТоварыСтранаПроизводителя",
		"Объект.Товары.СтранаПроизводителя",
		ПараметрыПоляВвода));
	
	Возврат ДобавляемыеЭлементы;
КонецФункции

Функция ПолучитьСтандартныеПараметрыПоляВвода() Экспорт
	ПараметрыПоляВвода = Новый Структура;
	ПараметрыПоляВвода.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
	ПараметрыПоляВвода.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ПараметрыПоляВвода.Вставить("МаксимальнаяШирина", 28);
	Возврат ПараметрыПоляВвода;
КонецФункции

Функция ДобавитьЭлементыТаблицыТоварыКакПоляВвода(Элементы, 
												  ЭлементРодитель,
												  НастройкиПолей)
	СозданныеПоля = Новый Массив;
	Для Каждого НастройкиПоля Из НастройкиПолей Цикл
		ВставитьПередЭлементом = ?(ПустаяСтрока(НастройкиПоля.ВставитьПередЭлементом),
			Неопределено,
			Элементы.Найти(НастройкиПоля.ВставитьПередЭлементом));
		ОписаниеСобытий = Неопределено;
		НастройкиПоля.Свойство("ОписаниеСобытий", ОписаниеСобытий);
		СозданныеПоля.Добавить(ФормыУХ.СоздатьПолеФормы(
			Элементы,
			НастройкиПоля.Имя,
			НастройкиПоля.Заголовок, 
			НастройкиПоля.ПутьКДанным,
			НастройкиПоля.Вид,
			ЭлементРодитель,
			ВставитьПередЭлементом,
			НастройкиПоля.ПараметрыПоляВвода,
			ОписаниеСобытий));
	КонецЦикла;
	Возврат СозданныеПоля;
КонецФункции

// Создаем элементы, если включено использование ЦУЗ.
// Переключение по виду договора не используем.
// Любой заказ поставщику будет иметь реквизиты и элементы ЦУЗ,
// даже если договор не подразумевает план поставок.
// Идея в том, чтобы не переинециализировать форму в случае
// смены договора.
//
Процедура ФормаДокумента_ИнициализироватьФормуЦУЗ(Форма)

	ФормаДокумента_СоздатьРеквизитыФормы(Форма);
	
	Если Не ФормыУХ.ЭлементыФормыУХУжеСозданы(Форма) Тогда
		ФормаДокумента_СоздатьЭлементыФормы(Форма.Элементы);
		ФормаДокумента_ПодключитьОбработчикиСобытийERPЭлементовФормы(Форма);
		ФормаДокумента_СоздатьКомандыЗаполненияТоваров(Форма, "ГруппаТоварыЗаполнить");
		ФормыУХ.ЭлементыФормыУХДобавлены(Форма);
	КонецЕсли;      
	Если Форма.ИмяФормы <> "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		СоздатьЭлементыАналитикиСтатейБюджетов(Форма);                           
	КонецЕсли;      
	
КонецПроцедуры

Процедура ФормаДокумента_СоздатьРеквизитыФормы(Форма)
	ДобавляемыеРеквизиты = Новый Массив();
	ФормыУХ.СоздатьДобавитьРеквизитФормы(
		Форма,
		ДобавляемыеРеквизиты,
		"ХарактеристикиИсходныеИспользуются",
		"Булево",
		"Объект.Товары");
	ФормыУХ.СоздатьДобавитьРеквизитФормы(
		Форма,
		ДобавляемыеРеквизиты,
		"ИспользуетсяУправлениеЗакупками",
		"Булево");
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры

Процедура ФормаДокумента_ПодключитьОбработчикиСобытийERPЭлементовФормы(Форма)
	ПереопределениеСобытийФормы.ПереопределитьСобытиеЭлементаФормы(
		Форма, 
		Форма.Элементы.Склад,
		"ПриИзменении",
		"Подключаемый_УХ_ПолеФормы_ПриИзменении");
КонецПроцедуры

Процедура ФормаДокумента_СоздатьЭлементыФормы(Элементы)
	ПараметрыПоляВвода = ПолучитьСтандартныеПараметрыПоляВвода();
	ФормыУХ.СоздатьПолеФормы(
		Элементы,
		"МестоПоставки",
		"", 
		"Объект.МестоПоставки",
		ВидПоляФормы.ПолеВвода,
		Элементы.ШапкаПраво,
		Элементы.Склад,
		ПараметрыПоляВвода,
		СоздатьОписаниеСобытий(
			"ПриИзменении",
			"Подключаемый_УХ_ПолеФормы_ПриИзменении"));	
		
	// Поля табличной части Товары редактировать запрещено.
	ДобавитьЭлементыТаблицыТоварыКакПоляВвода(
		Элементы,
		Элементы.Товары,
		ПолучитьПараметрыДобавляемыхЭлементовТЧТовары(ПараметрыПоляВвода));
КонецПроцедуры
	
Процедура ФормаДокумента_СоздатьКомандыЗаполненияТоваров(Форма, ИмяГруппыКоманд)
	Элементы = Форма.Элементы;
	ФормыУХ.СоздатьКоманду(
		Форма, 
		"ЗаполнитьПлановымиПотребностямиУХ", 
		"Заполнить по плану поставок", 
		"Подключаемый_УХ_ЗаполнитьПлановымиПотребностями");
	ФормыУХ.СоздатьКоманду(
		Форма, 
		"ПодборИзОстатковПланаПоставокУХ", 
		"Подбор из плана поставок", 
		"Подключаемый_УХ_ПодборИзПланаПоставок",
		БиблиотекаКартинок.Подбор);
	ФормыУХ.СоздатьКнопкуФормы(
		Элементы, 
		"ТоварыЗаполнитьПлановымиПотребностямиУХ",
		"",
		"ЗаполнитьПлановымиПотребностямиУХ",
		ВидКнопкиФормы.КнопкаКоманднойПанели,
		Элементы[ИмяГруппыКоманд]);
	ФормыУХ.СоздатьКнопкуФормы(
		Элементы, 
		"ТоварыПодборИзОстатковПланаПоставокУХ",
		"",
		"ПодборИзОстатковПланаПоставокУХ",
		ВидКнопкиФормы.КнопкаКоманднойПанели,
		Элементы[ИмяГруппыКоманд]);
КонецПроцедуры

Процедура СоздатьЭлементыФормыСписка(Форма)
		Если ФормыУХ.ЭлементыФормыУХУжеСозданы(Форма) Тогда
			Возврат;
		КонецЕсли;
		Элементы = Форма.Элементы;
		ПараметрыПоляВвода = ПолучитьСтандартныеПараметрыПоляВвода();
		ВстраиваниеУХ.СоздатьПолеФормы(
			Элементы,
			"МестоПоставки",
			"", 
			"Список.Ссылка.МестоПоставки",
			ВидПоляФормы.ПолеВвода,
			Элементы.Список,
			Элементы.СписокМенеджер,
			ПараметрыПоляВвода);
		ФормыУХ.ЭлементыФормыУХДобавлены(Форма);
КонецПроцедуры

Функция ПолучитьПараметрыЭлементаФормы(Имя, 
									   ПутьКДанным,
									   ПараметрыПоляВвода,
									   ВставитьПередЭлементом="",
									   Заголовок="",
									   Вид=Неопределено,
									   ОписаниеСобытий=Неопределено) Экспорт
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("Имя", Имя);
	ПараметрыЭлемента.Вставить("ПутьКДанным", ПутьКДанным);
	ПараметрыЭлемента.Вставить("Заголовок", Заголовок);
	ПараметрыЭлемента.Вставить("Вид", 
		?(Вид=Неопределено, ВидПоляФормы.ПолеВвода, Вид));
	ПараметрыЭлемента.Вставить("ВставитьПередЭлементом", ВставитьПередЭлементом);
	ПараметрыЭлемента.Вставить("ПараметрыПоляВвода", ПараметрыПоляВвода);
	ПараметрыЭлемента.Вставить("ОписаниеСобытий", ОписаниеСобытий); 
	Возврат ПараметрыЭлемента;
КонецФункции

// Создает структуру, в которой ключами будут имена из СтрокаИменСобытий,
// а значениями будут соответствующием им имена из СтрокаИменФункций.
// Разделитель имен в строке - запятая. Пробелы допускаются, но будут
// исключены из имен.
//
Функция СоздатьОписаниеСобытий(СтрокаИменСобытий, СтрокаИменФункций)
	Результат = Новый Структура;
	мИменаСобытий = СтрРазделить(СтрокаИменСобытий, ",", Ложь);
	мИменаФункций = СтрРазделить(СтрокаИменФункций, ",", Ложь);
	КолвоИмен = Мин(мИменаСобытий.Количество(), мИменаФункций.Количество()) - 1;
	Для Ном = 0 По КолвоИмен Цикл
		Результат.Вставить(
			СокрЛП(мИменаСобытий[Ном]),
			СокрЛП(мИменаФункций[Ном]));
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СоздатьСвязиПараметровВыбора(мСвязейПараметровВыбора)
	Возврат Новый ФиксированныйМассив(мСвязейПараметровВыбора);
КонецФункции

Функция ПолучитьПараметрыПоляВводаХарактеристикиНоменклатуры(ПараметрыПоляВвода)
	ПараметрыХарактеристики = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(
		ПараметрыПоляВвода);
	ПараметрыХарактеристики.Вставить(
		"СвязиПараметровВыбора",
		СоздатьСвязиПараметровВыбора(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				Новый СвязьПараметраВыбора(
					"Номенклатура",
					"Элементы.Товары.ТекущиеДанные.НоменклатураИсходная"))));
	Возврат ПараметрыХарактеристики;
КонецФункции

Процедура СоздатьЭлементыАналитикиСтатейБюджетов(Форма) 
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ПараметрыЭлементов = ПолучитьПараметрыЭлементовПоУмолчанию();
	
	ПараметрыПоляВвода = Новый Структура;
	
	ПараметрыПоляФлажка = Новый Структура;
	ПараметрыПоляФлажка.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	
	ФормыУХ.СоздатьПолеФормы(Элементы, "ЦФО", "", "Объект.Товары.ЦФО", ВидПоляФормы.ПолеВвода, Элементы.Товары, Элементы.ТоварыГруппаПолучатель); 
	ФормыУХ.СоздатьПолеФормы(Элементы, "Проект", "", "Объект.Товары.Проект", ВидПоляФормы.ПолеВвода, Элементы.Товары, Элементы.ТоварыГруппаПолучатель);
	
	// Статьи бюджетов
	МассивОписанийСтатей = Новый Массив;
	
	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиТаблицыЗначенийРеквизитаФормыВТаблицеФормы(МассивОписанийСтатей,
						"Объект.Товары", "Товары",
						"СтатьяБюджетаБДР", "ТоварыСтатьяБюджета",
						"АналитикаБДР%1", "ТоварыАналитика%1",
						ФормыУХ.РазместитьПередЭлементомСтрокой(Элементы.ТоварыГруппаПолучатель));
	
	// Создать элементы формы для статей бюджетов и их аналитик
	АналитикиСтатейБюджетовУХ.СоздатьСтатьиБюджетовИАналитики(Форма, МассивОписанийСтатей, ПараметрыЭлементов.ПолеВвода);
	
	СоздатьЭлементыВидыБюджетов(Форма);
	Элементы.ТоварыСтатьяБюджета.СвязьПоТипу = Новый СвязьПоТипу("ВидБюджетаБДР");
	
КонецПроцедуры   

Процедура СоздатьЭлементыВидыБюджетов(Форма)   

	Элементы = Форма.Элементы;

	ДобавляемыеРеквизиты = Новый Массив;  
	
	Реквизит = Новый РеквизитФормы("ВидБюджетаБДДС", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыБюджетов"));
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = Новый РеквизитФормы("ВидБюджетаБДР", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыБюджетов"));
	ДобавляемыеРеквизиты.Добавить(Реквизит);    
	
    Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);      
	Форма.ВидБюджетаБДДС = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
	Форма.ВидБюджетаБДР = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов;
	
	ПараметрыЭлемента = Новый Структура("Видимость", Ложь);     	
	ФормыУХ.СоздатьПолеФормы(Элементы, "ВидБюджетаБДДС", , "ВидБюджетаБДДС", ВидПоляФормы.ПолеВвода, Форма, , ПараметрыЭлемента); 
	ФормыУХ.СоздатьПолеФормы(Элементы, "ВидБюджетаБДР", , "ВидБюджетаБДР", ВидПоляФормы.ПолеВвода, Форма, , ПараметрыЭлемента);
	
КонецПроцедуры

Функция ПолучитьПараметрыЭлементовПоУмолчанию()
	
	ПараметрыПоляВвода = Новый Структура;
	
	ПараметрыПоляВвода28 = Новый Структура;
	ПараметрыПоляВвода28.Вставить("ПоложениеЗаголовка", 	ПоложениеЗаголовкаЭлементаФормы.Лево);
	ПараметрыПоляВвода28.Вставить("АвтоМаксимальнаяШирина",	Ложь);
	ПараметрыПоляВвода28.Вставить("МаксимальнаяШирина",		28);
	
	ПараметрыПоляФлажка = Новый Структура;
	ПараметрыПоляФлажка.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	
	// Вертикальная группа
	ПараметрыВертикаль = Новый Структура;
	ПараметрыВертикаль.Вставить("ОтображатьЗаголовок",	Ложь);
	ПараметрыВертикаль.Вставить("Группировка",			ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ПараметрыВертикаль.Вставить("Объединенная",			Истина);
	ПараметрыВертикаль.Вставить("Отображение",			ОтображениеОбычнойГруппы.Нет);
	
	// Параметры элементов, которые можно использовать в формах
	ПараметрыЭлементов = Новый Структура;
	ПараметрыЭлементов.Вставить("ПолеФлажка",	ПараметрыПоляФлажка);
	ПараметрыЭлементов.Вставить("ПолеВвода",	ПараметрыПоляВвода);
	ПараметрыЭлементов.Вставить("ПолеВвода28",	ПараметрыПоляВвода28);
	ПараметрыЭлементов.Вставить("ГруппаВ",		ПараметрыВертикаль);
	
	Возврат ПараметрыЭлементов;
	
КонецФункции

#КонецОбласти
